#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mehrenreich/k8s-hcloud/runs/run-wTYv9evxF6wt5qFh

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
hcloud_placement_group.nodes: Refreshing state... [id=55617]
hcloud_ssh_key.default: Refreshing state... [id=6939361]
hcloud_network.kubernetes: Refreshing state... [id=1772456]
hcloud_placement_group.controllers: Refreshing state... [id=55616]
hcloud_network_subnet.kubernetes: Refreshing state... [id=1772456-172.16.0.0/24]
hcloud_server.controller[0]: Refreshing state... [id=21644632]
hcloud_server.node[0]: Refreshing state... [id=21644631]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # hcloud_server.controller[0] will be updated in-place
  ~ resource "hcloud_server" "controller" {
        id                         = "21644632"
        name                       = "controller-1"
        # (17 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "172.16.0.2" -> null
          - mac_address = "86:00:00:16:2b:41" -> null
          - network_id  = 1772456 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = 1772456
        }
    }

  # hcloud_server.node[0] will be updated in-place
  ~ resource "hcloud_server" "node" {
        id                         = "21644631"
        name                       = "node-1"
        # (17 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "172.16.0.3" -> null
          - mac_address = "86:00:00:16:2b:40" -> null
          - network_id  = 1772456 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = 1772456
        }
    }

  # hcloud_server.node[1] will be created
  + resource "hcloud_server" "node" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "hel1"
      + name                       = "node-2"
      + placement_group_id         = 55617
      + rebuild_protection         = false
      + server_type                = "cpx11"
      + ssh_keys                   = [
          + "6939361",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = 1772456
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ controllers = [
      ~ {
            id                         = "21644632"
            name                       = "controller-1"
          ~ network                    = [
              - {
                  - alias_ips   = []
                  - ip          = "172.16.0.2"
                  - mac_address = "86:00:00:16:2b:41"
                  - network_id  = 1772456
                },
                # (1 unchanged element hidden)
            ]
            # (22 unchanged elements hidden)
        },
    ]
  ~ nodes       = [
      ~ {
            id                         = "21644631"
            name                       = "node-1"
          ~ network                    = [
              - {
                  - alias_ips   = []
                  - ip          = "172.16.0.3"
                  - mac_address = "86:00:00:16:2b:40"
                  - network_id  = 1772456
                },
                # (1 unchanged element hidden)
            ]
            # (22 unchanged elements hidden)
        },
      + {
          + backup_window              = (known after apply)
          + backups                    = false
          + datacenter                 = (known after apply)
          + delete_protection          = false
          + firewall_ids               = (known after apply)
          + id                         = (known after apply)
          + ignore_remote_firewall_ids = false
          + image                      = "ubuntu-20.04"
          + ipv4_address               = (known after apply)
          + ipv6_address               = (known after apply)
          + ipv6_network               = (known after apply)
          + iso                        = null
          + keep_disk                  = false
          + labels                     = null
          + location                   = "hel1"
          + name                       = "node-2"
          + network                    = [
              + {
                  + alias_ips   = []
                  + ip          = (known after apply)
                  + mac_address = (known after apply)
                  + network_id  = 1772456
                },
            ]
          + placement_group_id         = 55617
          + rebuild_protection         = false
          + rescue                     = null
          + server_type                = "cpx11"
          + ssh_keys                   = [
              + "6939361",
            ]
          + status                     = (known after apply)
          + timeouts                   = null
          + user_data                  = null
        },
    ]

```

</details>

*Pushed by: @mehrenreich, Action: `pull_request`*